<!-- terraform-plan:dev -->
## terraform-plan (dev)

**Plan: 1 to add, 0 to change, 0 to destroy.**

<details>
<summary>Show full plan output</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_identity_platform_config.default will be created
  + resource "google_identity_platform_config" "default" {
      + authorized_domains         = (known after apply)
      + autodelete_anonymous_users = true
      + id                         = (known after apply)
      + name                       = (known after apply)
      + project                    = "dungeon-studio-genshin-dev"

      + client (known after apply)

      + mfa (known after apply)

      + monitoring (known after apply)

      + sign_in (known after apply)

      + sms_region_config (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + firebase_auth_config_name  = (known after apply)

```
</details>